<?php
/*
--------------------|143. 1_General Settings - Creating Necessary Files and Designs |----------------

১. General Settings Module তৈরির প্রয়োজনীয়তা:
    কারেন্সি সিম্বলের মতো স্ট্যাটিক ফিচার ডাইনামিক করতে হবে, যেমন ডলার সাইনকে ইউরো সাইনে পরিবর্তন।
    সাইটের নাম, লোগো, এবং থিম কালার পরিবর্তন করার ব্যবস্থা থাকবে।


২. General Settings Module তৈরির স্টেপস:
 -সাইডবারে নতুন Settings অপশন যোগ করা:
    কোডে sidebar.blade.php এ নতুন আইটেম যোগ করা।
    সেটিংস রুট তৈরি করা এবং ফ্রন্টএন্ডে দেখানো।

 -মডেল, মাইগ্রেশন এবং কন্ট্রোলার তৈরি:

    php artisan make:model Setting -m দিয়ে মডেল এবং মাইগ্রেশন তৈরি।
    php artisan make:controller Admin/SettingController দিয়ে কন্ট্রোলার তৈরি।
    ডিফল্ট ডেটার জন্য php artisan make:seeder SettingSeeder তৈরি।

-রাউট সেটআপ এবং ভিউ ফাইল তৈরি:

    admin.php ফাইলে setting.index রুট তৈরি।
    SettingController এ index() মেথড তৈরি এবং admin/settings/index.blade.php ভিউ লিংক করা।
    slider index code copy করে setting এর মদ্ধে রাখব। এই খানে কন ডাটাটেবিল তৈরি করা লাগবে না।

সেটিংস পেজ ডিজাইন করা:

HTML টেমপ্লেট থেকে একটি ট্যাব ডিজাইন ব্যবহার করা।
 ট্যাব ব্যবহার করে সেটিংস বিভিন্ন ক্যাটাগরিতে বিভক্ত (যেমন: জেনারেল সেটিংস, থিম সেটিংস)।

৩. ডাইনামিক ফিচার তৈরির পরিকল্পনা:
    ট্যাব অনুযায়ী বিভিন্ন সেটিংস view দেখানোর জন্য ট্যাব ডিজাইনের ID ব্যবহার।

    ভবিষ্যতে প্রতিটি ট্যাবের মধ্যে ফর্ম যোগ করা হবে, যেখানে অ্যাডমিন সাইটের বিভিন্ন সেটিংস ডাইনামিকভাবে পরিবর্তন করতে পারবেন।

৪. পরবর্তী কাজ:
জেনারেল সেটিংস ফর্ম তৈরি করা।
কারেন্সি, নাম, এবং অন্যান্য ফিচার ডাইনামিক করার কোড লেখা।


*/
