<?php
/*
--------------------|152. 1_Cart Feature - Working with Product Popup Modal (Part - 1)|----------------

পপ-আপ মডেল ডায়নামিক করা:

এখন কার্ট ফিচার নিয়ে কাজ শুরু হবে, যেখানে পণ্য কার্টে যোগ করা যাবে। বাটনে ক্লিক করলে পপ-আপে পণ্যের তথ্য দেখানো হবে (নাম, দাম, ভ্যারিয়েন্ট, ইত্যাদি)।এই তথ্যগুলো ডায়নামিকভাবে সার্ভার থেকে ফেচ করা হবে। বাটনে ক্লিক করলে AJAX রিকোয়েস্ট পাঠানো হবে। সার্ভার থেকে পণ্যের তথ্য ডায়নামিকভাবে রিটার্ন হবে। সেই তথ্য পপ-আপ বডিতে রেন্ডার করা হবে।

ডাটাবেস টার্গেট এবং ডাটাবেস টগল অ্যাট্রিবিউট রিমুভ করা হয়েছে। বাটনে onClick ফাংশন যোগ করা হয়েছে globalScript এর মদ্ধে loadProductModel function এড করলাম।

Next: প্রাথমিকভাবে একটি অ্যালার্ট বক্স দেখানো হয়েছে, যাতে প্রোডাক্ট আইডি সঠিকভাবে পাস হচ্ছে কিনা তা যাচাই করা যায়।
পরবর্তী ধাপে AJAX রিকোয়েস্ট তৈরি করা হবে।



*/


/*
--------------------|153. 2_Cart Feature - Working with Product Popup Modal (Part - 2)|----------------

1. AJAX স্ক্যাফোল্ডিং তৈরি:
    - method, url, success, এবং error সহ AJAX এর বেসিক কাঠামো তৈরি করা হয়েছে।
    - console.log দিয়ে ডিবাগিং এবং যদি error আছে console.error এ ত্রুটি দেখানো হয়েছে।

2. Route তৈরি:
    web.php ফাইলে একটি নতুন গেট রুট (loadProductModel) তৈরি করা হয়েছে। সাতে product ID প্রদান করা হয়েছে।

3. global-script-blade.php এইটা ব্লেড ফাইলে রাউটের নাম ব্যবহার করতে URL: {{  }} ব্যবহার করা হয়েছে।
    -একটি placeholder যোগ করা হয়েছে :productId নামে এবং replace() ফাংশন ব্যবহার করে ডাইনামিক productId আইডি দিয়ে তা প্রতিস্থাপন করা হবে

4. Controller-এ নতুন মেথড:
    loadProductModel নামে একটি মেথড তৈরি করা হয়েছে, যা ডাটাবেজ থেকে প্রোডাক্ট ডেটা রিটার্ন করে।
    findOrFail দিয়ে প্রোডাক্ট খোঁজা হয়েছে, যা ভুল আইডি থাকলে ত্রুটি ফেলে।
    ইগার লোডিং: with() মেথড ব্যবহার করে প্রোডাক্টের সাথে সম্পর্কিত ডেটা (যেমন productSizes, productOptions) লোড করা হয়েছে।


 AJAX Request চেক: Network ট্যাবে AJAX রিকোয়েস্ট এবং রেসপন্স যাচাই করলাম রিলেশন ডেটাসহ প্রোডাক্ট ডেটা সঠিকভাবে এসেছে কিনা তা ডিবাগ করা হয়েছে।
*/



/*
--------------------|154. 3_Cart Feature - Working with Product Popup Modal (Part - 3)|----------------
 1. ভিউ ডাইনামিক করা:
    -পণ্য সম্পর্কিত ডেটা ডাইনামিকভাবে প্রদর্শন করতে একটি নতুন ব্লেড ফাইল তৈরি করা হয়েছে। frontend/layouts/ajax-files/product-popup-modal.blade.php, মূল model-body ডিভ থেকে কোড কেটে এই নতুন ফাইলে পেস্ট করা হয়েছে। frontend/home/components/cart-popup.blade.php
    - এই model-body  এর মদ্ধে load_product_modal_body নামে একটা  ক্লাস এড করে দিলাম।
    - আর অই খান থেকে cartModal এই id টা copy করলাম।

2. global-scripts.blade.php এর dynamic ভাবে অ্যাড করে দিলাম।


*/


/*
--------------------|155. 4_Cart Feature - Working with Product Popup Modal (Part - 4)|----------------

ইমেজ সোর্সে ডাইনামিক ভেরিয়েবল যোগ করে পণ্যের থাম্বনেইল ইমেজ প্রদর্শন করা হয়েছে। and লিংক ডাইনামিকভাবে route ব্যবহার করে তৈরি করা হয়েছে।

কারেন্সি  ফাংশন ব্যবহার করে অফার প্রাইস থাকলে তা দেখানো হচ্ছে, নাহলে মূল প্রাইস দেখানো হচ্ছে।


*/
