<?php
/*
--------------------|152. 1_Cart Feature - Working with Product Popup Modal (Part - 1)|----------------

পপ-আপ মডেল ডায়নামিক করা:

এখন কার্ট ফিচার নিয়ে কাজ শুরু হবে, যেখানে পণ্য কার্টে যোগ করা যাবে। বাটনে ক্লিক করলে পপ-আপে পণ্যের তথ্য দেখানো হবে (নাম, দাম, ভ্যারিয়েন্ট, ইত্যাদি)।এই তথ্যগুলো ডায়নামিকভাবে সার্ভার থেকে ফেচ করা হবে। বাটনে ক্লিক করলে AJAX রিকোয়েস্ট পাঠানো হবে। সার্ভার থেকে পণ্যের তথ্য ডায়নামিকভাবে রিটার্ন হবে। সেই তথ্য পপ-আপ বডিতে রেন্ডার করা হবে।

ডাটাবেস টার্গেট এবং ডাটাবেস টগল অ্যাট্রিবিউট রিমুভ করা হয়েছে। বাটনে onClick ফাংশন যোগ করা হয়েছে globalScript এর মদ্ধে loadProductModel function এড করলাম।

Next: প্রাথমিকভাবে একটি অ্যালার্ট বক্স দেখানো হয়েছে, যাতে প্রোডাক্ট আইডি সঠিকভাবে পাস হচ্ছে কিনা তা যাচাই করা যায়।
পরবর্তী ধাপে AJAX রিকোয়েস্ট তৈরি করা হবে।



*/
