<?php

/* --------------------| 131. 1_Product Size Variant - Creating Necessary Files and Designs |---------------

1. যেখানে আমরা প্রোডাক্ট এর গ্যালারি ইমেজ আপলোড করেছি সেখানে প্রোডাক্ট এর সাইজ এবং খাবারের অপশনাল বিষয়গুলো এড করবো
    - এজন্য আমার প্রোডাক্টে data table গেলাম, গ্যালারি লিংকের নিচে আরেকটা লিঙ্ক অ্যাড করব size  নামে. সেই সাথে সাইজের জন্য একটি রাউট তৈরি করতে হবে, এবং একটি সাইজ কন্ট্রোলার বানাবো php artisan make:controller Admin/ProductSizeController, এবার একটি মডেল বানাবো  php artisan make:model ProductSize -m

    -এরপর গ্যালারি ইনডেক্স থেকে সকল কোড নিয়ে এসে প্রোডাক্ট সাইজের ভিতরে পেস্ট করব

    - admin রাউট ফাইল তৈরি করলাম
    
    -প্রোডাক্ট সাইজ নামে একটি ডাউট তৈরি করতে হবে যেন সেই প্রোডাক্টটি এগেইনস্টে যে সাইজ গুলি রয়েছে সেগুলো ট্র্যাক করার জন্য






*/

