<?php

/*
    --------------------| 136. 1_Showing Products - Show Dynamic Product in Food Menu Section (Part - 1)|----------------

    1 যেহেতু আমরা backend থেকে সকল ডাটা তুলে নিয়ে এসে ফন্টে দেখাবো সেহেতু  frontend controller মধ্যে ক্যাটাগরি variable যে লজিকটি তৈরি করব Show_at_home = 1 and status =1 থাকে তাহলে ডাটা গুলো দেখাবে

    2. ক্যাটাগরি নাম গুলি স্ট্যাটিকভাবে কেটে দিয়ে এখানে ডাইনামিক ভাবে দেখানোর জন্য loop চালাবো. এখানে ক্যাটাগরির নাম গুলো backend থেকে ডাইনামিক ভাবে দেখাবে. কারন আমরা frontend controller থেকে category model er logic তৈরি করেছি এবং তা front_end.index পাঠিয়ে দিয়েছি

    3. category and data filter dynamic করলাম। এবং প্রোডাক্ট এর static data গুলা ফেলে দিলাম।


 */


 /*
    --------------------|137. 2_Showing Products - Show Dynamic Product in Food Menu Section (Part - 2)|----------------
1. এখানে আমরা query করলাম

2. প্রোডাক্টের কর্নারের ক্যাটেগরির নাম ডিসপ্লে করানোর জন্য প্রোডাক্ট মডেলের মধ্যে ক্যাটাগরি একটি belong ফাংশন তৈরি করলাম যা পরবর্তীতে প্রোডাক্ট html e ডায়নামিকভাবে ক্যাটাগরির নাম গুলো ডিসপ্লে করাতে পারলাম
- এখানে একটা সেফটি ব্যবস্থা করছি যদি ক্যাটাগরি কোন কারণে রিমুভ হয়ে যায় এখানে আমরা@  ব্যবহার করলাম সেফটির জন্য. @ এর ব্যবহার করা হয় যে কোন নাল ডেটা প্রতিরোধ করার জন্য



*/



 /*
    --------------------|138. 3_Showing Products - Show Dynamic Product in Product View Page (Part - 1)|----------------

    এই প্রোডাক্ট শো বলতে বোঝায় যখন প্রোডাক্ট এর টাইটেলে ক্লিক করা হবে তার ডিটেল পেজে প্রোডাক্টটা দেখাবে


    1. web.php এর ভেতরে নতুন একটা রাউট তৈরি করলাম সেটা হচ্ছে প্রডাক্ট গুলাকে ডিসপ্লে করার জন্য.

    2. এবার আরেকটি মেথড বানাবো frontend controller  এর মধ্যে.  এখানে অলরেডি index  মেথড কাজ করছে সেটা শুধুমাত্র ইনডেক্স স্পেসকে ভিউ কে দেখানোর জন্য. আমরা আরেকটা তৈরি করব প্রোডাক্ট এর ডিটেল পেজটাকে দেখানোর জন্য. এই মেথডের ভিতর একটি প্যারামিটার রিসিভ করবে রাউট থেকে সেটা হচ্ছে slug

    3. এখানে একটি ভিউ ফাইল তৈরি করলাম প্রোডাক্ট ডিটেল পেইজ এর জন্য

    4. যেখানে প্রোডাক্টগুলো দেখাচ্ছে সেই html এর ভেতরে যেখানে প্রোডাক্টের টাইটেল আছে টাইটেলে যেখানে লিঙ্ক করার জায়গা সেখানে dynamic করব.

    5. প্রোডাক্ট ডিটেল পেইজ html কোড গুলো কপি করে  view > frontend >  pages >  Product-view.blade.php  এখানে স্ট্যাটিকভাবে রাখলাম





 */
