<?php

/*
    --------------------| 136. 1_Showing Products - Show Dynamic Product in Food Menu Section (Part - 1)|----------------

    1 যেহেতু আমরা backend থেকে সকল ডাটা তুলে নিয়ে এসে ফন্টে দেখাবো সেহেতু  frontend controller মধ্যে ক্যাটাগরি variable যে লজিকটি তৈরি করব Show_at_home = 1 and status =1 থাকে তাহলে ডাটা গুলো দেখাবে

    2. ক্যাটাগরি নাম গুলি স্ট্যাটিকভাবে কেটে দিয়ে এখানে ডাইনামিক ভাবে দেখানোর জন্য loop চালাবো. এখানে ক্যাটাগরির নাম গুলো backend থেকে ডাইনামিক ভাবে দেখাবে. কারন আমরা frontend controller থেকে category model er logic তৈরি করেছি এবং তা front_end.index পাঠিয়ে দিয়েছি

    3. category and data filter dynamic করলাম। এবং প্রোডাক্ট এর static data গুলা ফেলে দিলাম।


 */


 /*
    --------------------|137. 2_Showing Products - Show Dynamic Product in Food Menu Section (Part - 2)|----------------
1. এখানে আমরা query করলাম

2. প্রোডাক্টের কর্নারের ক্যাটেগরির নাম ডিসপ্লে করানোর জন্য প্রোডাক্ট মডেলের মধ্যে ক্যাটাগরি একটি belong ফাংশন তৈরি করলাম যা পরবর্তীতে প্রোডাক্ট html e ডায়নামিকভাবে ক্যাটাগরির নাম গুলো ডিসপ্লে করাতে পারলাম
- এখানে একটা সেফটি ব্যবস্থা করছি যদি ক্যাটাগরি কোন কারণে রিমুভ হয়ে যায় এখানে আমরা@  ব্যবহার করলাম সেফটির জন্য. @ এর ব্যবহার করা হয় যে কোন নাল ডেটা প্রতিরোধ করার জন্য





*/
